Revit 2024 API
BuiltInFailures.MEPCalculationFailures.Network_NoPressureConstraint Property
 The calculation could not be executed as configured. Each network requires at least 1 pressure constraint. Specify the pressure constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId Network_NoPressureConstraint { get; }
Visual Basic
Public Shared ReadOnly Property Network_NoPressureConstraint As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ Network_NoPressureConstraint {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace